RIET/src/Documents/ИнвентаризацияТоваровНаСкладе/ИнвентаризацияТоваровНаСкладе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИнвентаризацияТоваровНаСкладе</name>
  <comment>(Общ)</comment>
  <posting>Deny</posting>
  <attributes>
    <name>Comment</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>InventoryLocation</name>
    <type>
      <types>CatalogRef.InventoryLocations</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Goods</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>Good</name>
      <type>
        <types>CatalogRef.InventoryGoods</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxRegistration</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UOM</name>
      <type>
        <types>CatalogRef.UOMs</types>
      </type>
    </attributes>
    <attributes>
      <name>Sum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ActualQuantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ActualSum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУчет</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУчет</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаВРознице</name>
      <comment>(Общ) Розничная цена в розничной торговле, цена продажи при поступлении на комиссию по &quot;жесткой&quot; схеме</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ошибка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Segments</name>
    <attributes>
      <name>Segment</name>
      <type>
        <types>CatalogRef.Сегменты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/AccumulationRegisters/InventoryBatches/InventoryBatches.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>InventoryBatches</name>
  <resources>
    <name>Quantity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Sum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Fiscal</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>FiscalPeriod</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Good</name>
    <type>
      <types>CatalogRef.InventoryGoods</types>
    </type>
  </dimensions>
  <dimensions>
    <name>InventoryLocation</name>
    <type>
      <types>CatalogRef.InventoryLocations</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Batch</name>
    <type>
      <types>DocumentRef.InventoryПоступление</types>
      <types>DocumentRef.InventoryКорректировка</types>
      <types>DocumentRef.InventoryПеремещение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>FinishedGood</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Company</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>TaxRegistration</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/Documents/InventoryКорректировка/InventoryКорректировка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>InventoryКорректировка</name>
  <registerRecords>AccumulationRegister.ПроводкиDSSОбщие</registerRecords>
  <registerRecords>AccumulationRegister.MaterialsAndSupplies</registerRecords>
  <registerRecords>AccumulationRegister.InventoryTangibleAssetsCosts</registerRecords>
  <registerRecords>AccumulationRegister.InventoryBatches</registerRecords>
  <registerRecords>AccumulationRegister.МатериальныеАктивы</registerRecords>
  <attributes>
    <name>InventoryLocation</name>
    <type>
      <types>CatalogRef.InventoryLocations</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxRegistration</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>PoNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PO</name>
    <type>
      <types>CatalogRef.ЗаявкиНаЗакупку</types>
    </type>
  </attributes>
  <attributes>
    <name>Segment</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
  <attributes>
    <name>IctDocType</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HasFinishedGoods</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>LastModified</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Reference</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>OriginalDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TransactionType</name>
    <type>
      <types>EnumRef.InventoryTransactionsTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>InventoryСписание</name>
    <type>
      <types>DocumentRef.InventoryСписание</types>
      <types>DocumentRef.InventoryКорректировка</types>
    </type>
  </attributes>
  <attributes>
    <name>OrdNum</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Goods</name>
    <attributes>
      <name>Флаг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Good</name>
      <type>
        <types>CatalogRef.InventoryGoods</types>
      </type>
    </attributes>
    <attributes>
      <name>UOM</name>
      <type>
        <types>CatalogRef.UOMs</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FiscalPrice</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FiscalSum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FinishedGood</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ManagementPrice</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ManagementSum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Batch</name>
      <type>
        <types>DocumentRef.InventoryПоступление</types>
        <types>DocumentRef.InventoryКорректировка</types>
        <types>DocumentRef.InventoryПеремещение</types>
      </type>
    </attributes>
    <attributes>
      <name>Reference</name>
      <type>
        <types>CatalogRef.КомментарииКорректировок</types>
      </type>
    </attributes>
    <attributes>
      <name>DSS</name>
      <type>
        <types>DocumentRef.ПроводкаDSS</types>
      </type>
    </attributes>
    <attributes>
      <name>PoNumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Catalogs/КостЦентры/КостЦентры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КостЦентры</name>
  <comment>Параллельный с подразделениями учет ОС </comment>
  <attributes>
    <name>Segment</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
  <attributes>
    <name>SubSegment</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сегмент</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
  <attributes>
    <name>DefaultActivity</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OnlyMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxRegistration</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>NonLawson</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Geomarket</name>
    <type>
      <types>CatalogRef.GeoMarkets</types>
    </type>
  </attributes>
  <attributes>
    <name>SubGeomarket</name>
    <type>
      <types>CatalogRef.GeoMarkets</types>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/Documents/ИнвентаризацияТоваровНаСкладе/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ЗаполнитьТабличнуюЧастьПоРегистру()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КостЦентры.Ссылка
	|ПОМЕСТИТЬ AU
	|ИЗ
	|	Справочник.КостЦентры КАК КостЦентры
	|ГДЕ
	|	КостЦентры.Сегмент В ИЕРАРХИИ(&СписокСегментов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	InventoryBatchesОстатки.Good,
	|	InventoryBatchesОстатки.AU,
	|	СУММА(InventoryBatchesОстатки.QuantityОстаток) КАК Quantity,
	|	СУММА(InventoryBatchesОстатки.SumОстаток) КАК Sum,
	|	InventoryBatchesОстатки.Good.StandardUOM КАК UOM,
	|	СУММА(InventoryBatchesОстатки.QuantityОстаток) КАК ActualQuantity,
	|	СУММА(InventoryBatchesОстатки.SumОстаток) КАК ActualSum,
	|	ВЫБОР
	|		КОГДА InventoryBatchesОстатки.QuantityОстаток = 0
	|			ТОГДА 0
	|		ИНАЧЕ InventoryBatchesОстатки.SumОстаток / InventoryBatchesОстатки.QuantityОстаток
	|	КОНЕЦ КАК Price,
	|	InventoryBatchesОстатки.AU.TaxRegistration КАК TaxRegistration
	|ИЗ
	|	РегистрНакопления.InventoryBatches.Остатки(
	|			&ДатаДокумента,
	|			Company = 4
	|				И (&НеЗаполненаЛокация
	|					ИЛИ InventoryLocation = &InvLoc)
	|				И (&НеЗаполненСписокСегементов
	|					ИЛИ AU В
	|						(ВЫБРАТЬ
	|							AU.Ссылка
	|						ИЗ
	|							AU КАК AU))) КАК InventoryBatchesОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	InventoryBatchesОстатки.Good,
	|	InventoryBatchesОстатки.AU,
	|	InventoryBatchesОстатки.Good.StandardUOM,
	|	ВЫБОР
	|		КОГДА InventoryBatchesОстатки.QuantityОстаток = 0
	|			ТОГДА 0
	|		ИНАЧЕ InventoryBatchesОстатки.SumОстаток / InventoryBatchesОстатки.QuantityОстаток
	|	КОНЕЦ,
	|	InventoryBatchesОстатки.AU.TaxRegistration";
	Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);
	Запрос.УстановитьПараметр("НеЗаполненаЛокация", НЕ ЗначениеЗаполнено(Объект.InventoryLocation));
	Запрос.УстановитьПараметр("InvLoc", Объект.InventoryLocation);
	Если Объект.Segments.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("НеЗаполненСписокСегементов", Ложь);
		Запрос.УстановитьПараметр("СписокСегментов", Объект.Segments.Выгрузить( ,"Segment").ВыгрузитьКолонку("Segment"));
	Иначе
		Запрос.УстановитьПараметр("НеЗаполненСписокСегементов", Истина);
		Запрос.УстановитьПараметр("СписокСегментов", Новый Массив);
	КонецЕсли; 
	
	Результат = Запрос.Выполнить().Выгрузить();
	Объект.Goods.Загрузить(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
		Сообщить("Не указана дата документа!");
		Возврат;
	КонецЕсли; 
	Если Объект.Goods.Количество() > 0 Тогда
		Если Вопрос("Табличная часть Goods будет очищена! Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли; 
	ЗаполнитьТабличнуюЧастьПоРегистру();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ОбщегоНазначения.УстановитьЗначение(ТекущийОбъект.Responsible, ПараметрыСеанса.ТекущийПользователь);
КонецПроцедуры

&НаКлиенте
Процедура GoodsActualQuantityПриИзменении(Элемент)
	ТекСтрока = Элементы.Goods.ТекущиеДанные;
	ТекСтрока.ActualSum = ТекСтрока.Price * ТекСтрока.ActualQuantity;
КонецПроцедуры

&НаКлиенте
Процедура GoodsActualSumПриИзменении(Элемент)
	ТекСтрока = Элементы.Goods.ТекущиеДанные;
	ТекСтрока.ActualQuantity = ?(ТекСтрока.Price = 0, 0, ТекСтрока.ActualSum/ТекСтрока.Price);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ОсновнаяОрганизация");
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура Заполнить2011(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
		Сообщить("Не указана дата документа!");
		Возврат;
	КонецЕсли; 
	Если Объект.Goods.Количество() > 0 Тогда
		Если Вопрос("Табличная часть Goods будет очищена! Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли; 
	ВыполнитьЗаполнение2011();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗаполнение2011()
	Объект.Goods.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КостЦентры.Ссылка
	|ПОМЕСТИТЬ AU
	|ИЗ
	|	Справочник.КостЦентры КАК КостЦентры
	|ГДЕ
	|	КостЦентры.Сегмент В ИЕРАРХИИ(&СписокСегментов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	InventoryКорректировкаGoods.Good,
	|	СУММА(InventoryКорректировкаGoods.Quantity) КАК Quantity,
	|	СУММА(InventoryКорректировкаGoods.FiscalSum) КАК FiscalSum,
	|	InventoryКорректировкаGoods.Ссылка.InventoryLocation,
	|	InventoryКорректировкаGoods.AU.Segment КАК Segment
	|ПОМЕСТИТЬ Корректировки
	|ИЗ
	|	Документ.InventoryКорректировка.Goods КАК InventoryКорректировкаGoods
	|ГДЕ
	|	InventoryКорректировкаGoods.Ссылка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаДокумента, ГОД) И КОНЕЦПЕРИОДА(&ДатаДокумента, ГОД)
	|	И InventoryКорректировкаGoods.Ссылка.Проведен
	|	И InventoryКорректировкаGoods.Reference.Наименование ПОДОБНО ""%Count%""
	|	И InventoryКорректировкаGoods.Quantity > 0
	|	И InventoryКорректировкаGoods.FiscalSum > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	InventoryКорректировкаGoods.Good,
	|	InventoryКорректировкаGoods.Ссылка.InventoryLocation,
	|	InventoryКорректировкаGoods.AU.Segment
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	InventoryBatchesОстатки.Good,
	|	InventoryBatchesОстатки.AU,
	|	СУММА(InventoryBatchesОстатки.QuantityОстаток) КАК Quantity,
	|	СУММА(InventoryBatchesОстатки.SumОстаток) КАК Sum,
	|	InventoryBatchesОстатки.Good.StandardUOM КАК UOM,
	|	СУММА(InventoryBatchesОстатки.QuantityОстаток) КАК ActualQuantity,
	|	СУММА(InventoryBatchesОстатки.SumОстаток) КАК ActualSum,
	|	ВЫБОР
	|		КОГДА InventoryBatchesОстатки.QuantityОстаток = 0
	|			ТОГДА 0
	|		ИНАЧЕ InventoryBatchesОстатки.SumОстаток / InventoryBatchesОстатки.QuantityОстаток
	|	КОНЕЦ КАК Price,
	|	InventoryBatchesОстатки.AU.TaxRegistration КАК TaxRegistration,
	|	InventoryBatchesОстатки.InventoryLocation,
	|	InventoryBatchesОстатки.AU.Segment КАК Сегмент
	|ПОМЕСТИТЬ ТекущиеОстатки
	|ИЗ
	|	РегистрНакопления.InventoryBatches.Остатки(
	|			&ДатаДокумента,
	|			Company = 4
	|				И (&НеЗаполненаЛокация
	|					ИЛИ InventoryLocation = &InvLoc)
	|				И (&НеЗаполненСписокСегементов
	|					ИЛИ AU В
	|						(ВЫБРАТЬ
	|							AU.Ссылка
	|						ИЗ
	|							AU КАК AU))) КАК InventoryBatchesОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	InventoryBatchesОстатки.Good,
	|	InventoryBatchesОстатки.AU,
	|	InventoryBatchesОстатки.Good.StandardUOM,
	|	ВЫБОР
	|		КОГДА InventoryBatchesОстатки.QuantityОстаток = 0
	|			ТОГДА 0
	|		ИНАЧЕ InventoryBatchesОстатки.SumОстаток / InventoryBatchesОстатки.QuantityОстаток
	|	КОНЕЦ,
	|	InventoryBatchesОстатки.AU.TaxRegistration,
	|	InventoryBatchesОстатки.InventoryLocation,
	|	InventoryBatchesОстатки.AU.Segment
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекущиеОстатки.Good,
	|	ТекущиеОстатки.AU,
	|	ТекущиеОстатки.Quantity - ЕСТЬNULL(Корректировки.Quantity, 0) КАК Quantity,
	|	ТекущиеОстатки.Sum - ЕСТЬNULL(Корректировки.FiscalSum, 0) КАК Sum,
	|	ТекущиеОстатки.UOM,
	|	ТекущиеОстатки.ActualQuantity,
	|	ТекущиеОстатки.ActualSum,
	|	ТекущиеОстатки.Price,
	|	ТекущиеОстатки.TaxRegistration
	|ИЗ
	|	ТекущиеОстатки КАК ТекущиеОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Корректировки КАК Корректировки
	|		ПО ТекущиеОстатки.Good = Корректировки.Good
	|			И ТекущиеОстатки.InventoryLocation = Корректировки.InventoryLocation
	|			И ТекущиеОстатки.Сегмент = Корректировки.Segment";
	Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);
	Запрос.УстановитьПараметр("НеЗаполненаЛокация", НЕ ЗначениеЗаполнено(Объект.InventoryLocation));
	Запрос.УстановитьПараметр("InvLoc", Объект.InventoryLocation);
	Если Объект.Segments.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("НеЗаполненСписокСегементов", Ложь);
		Запрос.УстановитьПараметр("СписокСегментов", Объект.Segments.Выгрузить( ,"Segment").ВыгрузитьКолонку("Segment"));
	Иначе
		Запрос.УстановитьПараметр("НеЗаполненСписокСегементов", Истина);
		Запрос.УстановитьПараметр("СписокСегментов", Новый Массив);
	КонецЕсли; 
	
	Результат = Запрос.Выполнить().Выгрузить();
	Объект.Goods.Загрузить(Результат);
КонецПроцедуры

&НаКлиенте
Процедура Заполнить2012(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
		Сообщить("Не указана дата документа!");
		Возврат;
	КонецЕсли; 
	Если Объект.Goods.Количество() > 0 Тогда
		Если Вопрос("Табличная часть Goods будет очищена! Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли; 
	ВыполнитьЗаполнение2012();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗаполнение2012()
	Объект.Goods.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КостЦентры.Ссылка
	|ПОМЕСТИТЬ AU
	|ИЗ
	|	Справочник.КостЦентры КАК КостЦентры
	|ГДЕ
	|	КостЦентры.Сегмент В ИЕРАРХИИ(&СписокСегментов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	InventoryКорректировкаGoods.Good КАК Good,
	|	InventoryКорректировкаGoods.AU КАК AU,
	|	InventoryКорректировкаGoods.Ссылка
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	Документ.InventoryКорректировка.Goods КАК InventoryКорректировкаGoods
	|ГДЕ
	|	InventoryКорректировкаGoods.Ссылка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаДокумента, КВАРТАЛ) И КОНЕЦПЕРИОДА(&ДатаДокумента, КВАРТАЛ)
	|	И InventoryКорректировкаGoods.Ссылка.Проведен
	|	И InventoryКорректировкаGoods.Reference.Наименование ПОДОБНО ""%Count%""
	|	И (&НеЗаполненаЛокация
	|			ИЛИ InventoryКорректировкаGoods.Ссылка.InventoryLocation = &InvLoc)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Good,
	|	ВложенныйЗапрос.Quantity,
	|	ВложенныйЗапрос.FiscalSum,
	|	ВложенныйЗапрос.InventoryLocation,
	|	ВложенныйЗапрос.Segment
	|ПОМЕСТИТЬ Корректировки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Good КАК Good,
	|		СУММА(ВложенныйЗапрос.Quantity) КАК Quantity,
	|		СУММА(ВложенныйЗапрос.FiscalSum) КАК FiscalSum,
	|		ВложенныйЗапрос.InventoryLocation КАК InventoryLocation,
	|		ВложенныйЗапрос.Segment КАК Segment
	|	ИЗ
	|		(ВЫБРАТЬ
	|			InventoryBatches.Good КАК Good,
	|			СУММА(ВЫБОР
	|					КОГДА InventoryBatches.ВидДвижения = ЗНАЧЕНИЕ(виддвижениянакопления.приход)
	|						ТОГДА InventoryBatches.Quantity
	|					ИНАЧЕ -InventoryBatches.Quantity
	|				КОНЕЦ) КАК Quantity,
	|			СУММА(ВЫБОР
	|					КОГДА InventoryBatches.ВидДвижения = ЗНАЧЕНИЕ(виддвижениянакопления.приход)
	|						ТОГДА InventoryBatches.Sum
	|					ИНАЧЕ -InventoryBatches.Sum
	|				КОНЕЦ) КАК FiscalSum,
	|			InventoryBatches.InventoryLocation КАК InventoryLocation,
	|			InventoryBatches.AU.Segment КАК Segment
	|		ИЗ
	|			РегистрНакопления.InventoryBatches КАК InventoryBatches
	|		ГДЕ
	|			(InventoryBatches.Good, InventoryBatches.AU, InventoryBatches.Регистратор) В
	|					(ВЫБРАТЬ
	|						данные.Good,
	|						данные.AU,
	|						данные.Ссылка
	|					ИЗ
	|						данные)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			InventoryBatches.Good,
	|			InventoryBatches.InventoryLocation,
	|			InventoryBatches.AU.Segment) КАК ВложенныйЗапрос
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос.Good,
	|		ВложенныйЗапрос.InventoryLocation,
	|		ВложенныйЗапрос.Segment) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.Quantity > 0
	|	И ВложенныйЗапрос.FiscalSum > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	InventoryBatchesОстатки.Good,
	|	InventoryBatchesОстатки.AU,
	|	СУММА(InventoryBatchesОстатки.QuantityОстаток) КАК Quantity,
	|	СУММА(InventoryBatchesОстатки.SumОстаток) КАК Sum,
	|	InventoryBatchesОстатки.Good.StandardUOM КАК UOM,
	|	СУММА(InventoryBatchesОстатки.QuantityОстаток) КАК ActualQuantity,
	|	СУММА(InventoryBatchesОстатки.SumОстаток) КАК ActualSum,
	|	ВЫБОР
	|		КОГДА InventoryBatchesОстатки.QuantityОстаток = 0
	|			ТОГДА 0
	|		ИНАЧЕ InventoryBatchesОстатки.SumОстаток / InventoryBatchesОстатки.QuantityОстаток
	|	КОНЕЦ КАК Price,
	|	InventoryBatchesОстатки.AU.TaxRegistration КАК TaxRegistration,
	|	InventoryBatchesОстатки.InventoryLocation,
	|	InventoryBatchesОстатки.AU.Segment КАК Сегмент
	|ПОМЕСТИТЬ ТекущиеОстатки
	|ИЗ
	|	РегистрНакопления.InventoryBatches.Остатки(
	|			&ДатаДокумента,
	|			Company = 4
	|				И (&НеЗаполненаЛокация
	|					ИЛИ InventoryLocation = &InvLoc)
	|				И (&НеЗаполненСписокСегементов
	|					ИЛИ AU В
	|						(ВЫБРАТЬ
	|							AU.Ссылка
	|						ИЗ
	|							AU КАК AU))) КАК InventoryBatchesОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	InventoryBatchesОстатки.Good,
	|	InventoryBatchesОстатки.AU,
	|	InventoryBatchesОстатки.Good.StandardUOM,
	|	ВЫБОР
	|		КОГДА InventoryBatchesОстатки.QuantityОстаток = 0
	|			ТОГДА 0
	|		ИНАЧЕ InventoryBatchesОстатки.SumОстаток / InventoryBatchesОстатки.QuantityОстаток
	|	КОНЕЦ,
	|	InventoryBatchesОстатки.AU.TaxRegistration,
	|	InventoryBatchesОстатки.InventoryLocation,
	|	InventoryBatchesОстатки.AU.Segment
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекущиеОстатки.Good,
	|	ТекущиеОстатки.AU,
	|	ТекущиеОстатки.Quantity - ЕСТЬNULL(Корректировки.Quantity, 0) КАК Quantity,
	|	ТекущиеОстатки.Sum - ЕСТЬNULL(Корректировки.FiscalSum, 0) КАК Sum,
	|	ТекущиеОстатки.UOM,
	|	ТекущиеОстатки.ActualQuantity,
	|	ТекущиеОстатки.ActualSum,
	|	ТекущиеОстатки.Price,
	|	ТекущиеОстатки.TaxRegistration
	|ИЗ
	|	ТекущиеОстатки КАК ТекущиеОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Корректировки КАК Корректировки
	|		ПО ТекущиеОстатки.Good = Корректировки.Good
	|			И ТекущиеОстатки.InventoryLocation = Корректировки.InventoryLocation
	|			И ТекущиеОстатки.Сегмент = Корректировки.Segment";
	Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);
	Запрос.УстановитьПараметр("НеЗаполненаЛокация", НЕ ЗначениеЗаполнено(Объект.InventoryLocation));
	Запрос.УстановитьПараметр("InvLoc", Объект.InventoryLocation);
	Если Объект.Segments.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("НеЗаполненСписокСегементов", Ложь);
		Запрос.УстановитьПараметр("СписокСегментов", Объект.Segments.Выгрузить( ,"Segment").ВыгрузитьКолонку("Segment"));
	Иначе
		Запрос.УстановитьПараметр("НеЗаполненСписокСегементов", Истина);
		Запрос.УстановитьПараметр("СписокСегментов", Новый Массив);
	КонецЕсли; 
	
	Результат = Запрос.Выполнить().Выгрузить();
	Объект.Goods.Загрузить(Результат);
КонецПроцедуры

&НаКлиенте
Процедура Проверка(Команда)
	
	Для Каждого СтрокаТЧ Из Объект.Goods Цикл
		Если СтрокаТЧ.Sum < 0 Или СтрокаТЧ.Price = 1 Тогда
			СтрокаТЧ.Ошибка = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
